Autodesk.Revit.DB.RevisionSettings.IsAcceptableRevisionCloudSpacing(System.Double)
Rounds the given raw value and checks whether it is an acceptable cloud spacing value after it is rounded.
Remarks:
After rounding, the value must be a valid length that is greater than zero.
rawValue:
The raw value to check.  This value need not be rounded prior to calling this function.
Returns:
True if the value will be acceptable after rounding, False otherwise
Since:
2015

Autodesk.Revit.DB.RevisionSettings.RoundRevisionCloudSpacing(Autodesk.Revit.DB.Document,System.Double)
Rounds the given revision cloud spacing value according to the document's settings.
ccda:
The document to use for rounding.
rawValue:
The unrounded value.
Returns:
The rounded revision cloud spacing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.RevisionSettings.SetAlphanumericRevisionSettings(Autodesk.Revit.DB.AlphanumericRevisionSettings)
Replaces the current alphanumeric revision numbering settings with the specified AlphanumericRevisionSettings.
newSettings:
The specified AlphanumericRevisionSettings to be applied to alphanumeric revision numbering.
Throws Autodesk.Revit.Exceptions.ArgumentException:
newSettings is not a valid AlphanumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.RevisionSettings.GetAlphanumericRevisionSettings
Returns a copy of the AlphanumericRevisionSettings owned by this RevisionSettings object.
Returns:
The copy of the AlphaumericRevisionSettings owned by this RevisionSettings object.
Since:
2016

Autodesk.Revit.DB.RevisionSettings.SetNumericRevisionSettings(Autodesk.Revit.DB.NumericRevisionSettings)
Replaces the current numeric revision numbering settings with the specified NumericRevisionSettings.
newSettings:
The specified NumericRevisionSettings to be applied to numeric revision numbering.
Throws Autodesk.Revit.Exceptions.ArgumentException:
newSettings is not a valid NumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.RevisionSettings.GetNumericRevisionSettings
Returns a copy of the NumericRevisionSettings owned by this RevisionSettings object.
Returns:
The copy of the NumericRevisionSettings owned by this RevisionSettings object.
Since:
2016

Autodesk.Revit.DB.RevisionSettings.GetRevisionSettings(Autodesk.Revit.DB.Document)
Returns the RevisionSettings for the given project document.
ccda:
The document to get the RevisionSettings from.
Returns:
The RevisionSettings for the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ccda is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.RevisionSettings.RevisionCloudSpacing
Determines the size in paper space of revision clouds drawn in a project.
Remarks:
Revision clouds in Revit are created based on a collection of sketched lines.  Revit then
generates a series of "cloud bumps" along those lines to create a cloud shape.  This setting
determines the minimum length between the start and end each "cloud bump" (measured along the line).
For example, if this setting were 2" and the sketched line were 3" long, Revit would
create only one 3" bump.  If the line length was increased to 4", Revit would add two 2" ones.
Note that a single "cloud bump" consists of two arcs of slightly different size. Revit will always
draw at least one "cloud bump" for each sketched line.
This value will be interpreted by Revit in paper space rather than in model space so
that all of the clouds are shown in a uniform way on a sheet.  This value will be rounded to a length that can be displayed according to the
current project settings.  The value may not be zero after rounding.  This value may not
exceed the maximum distance that can be represented as a length in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: desiredCloudSpacing is not a valid value for the cloud spacing.
Since:
2015

Autodesk.Revit.DB.RevisionSettings.RevisionNumbering
Determines how the revision number values will display on sheets.
Remarks:
When revision clouds appear on a sheet, the revision number of each revision can be displayed either by
tagging the revision cloud or by a revision schedule within the sheet's titleblock.  There
are two ways the number can be determined:
Per project:  The value of the Revision numbers will always correspond to the project-wide Revision Sequence Number
assigned to the revision.  For example, if revision clouds for revisions with sequence numbers 5, 7, and 8 are
placed on a sheet then revision tags and schedules on that sheet would display 5, 7, and 8.Per sheet:  Revision numbers will be assigned consecutive numbers based on the revision clouds
visible on that sheet.   For example, if revision clouds for revisions assigned project-wide Revision Sequence Numbers 5, 7, and 8 are
placed on a sheet then revision tags and schedules on that sheet would display 1, 2, and 3.
The sequence on the sheet will still follow the relative ordering of the Revision Sequence Numbers,
so in this example revision 5 would be displayed as 1 on the sheet, revision 7 would be
displayed as 2, etc.  Note that changing this setting may change the numbering of revisions on any existing
sheets.  The numbering will be changed even for revisions that are already issued.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.RevisionSettings
Provides access to project-wide settings related to revisions.
Remarks:
This class provides access to the project-wide settings that affect the appearance and numbering of revisions
and revision clouds.  The settings are only available in project documents.
Since:
2015